{
	"about": "Hi! I'm a recent Computer Science graduate from UC Davis with a strong passion for web development, particularly front-end and UI/UX design. I enjoy crafting intuitive and visually engaging user interfaces using HTML/CSS, JavaScript, and React. My goal is to create seamless and user-friendly web experiences that make a positive impact.",
	"projects": [
		{
			"title": "Spotify Stats for Users",
			"description": "A dynamic web application that integrates with the Spotify Web API to display users' top tracks and artists across three distinct time ranges—past month, last 6 months, and all-time. The app features a clean, responsive UI and utilizes Spotify's PKCE authentication flow for secure login. Each track and artist links directly to Spotify, allowing users to revisit and share their favorite music. Designed for music lovers who want a visual and interactive way to explore their listening trends.",
			"images": ["topartists.webp", "toptracks.webp"],
			"link": "https://github.com/mgz11/statsspotify"
		},
		{
			"title": "Blush and Bloom Cafe",
			"description": "A fully functional prototype for a modern café web app. Users can browse the menu, manage a cart, and complete purchases via Stripe. Customers receive order confirmations via the Resend API. Admins can securely log in to manage the menu, track inventory, view orders, and analyze sales data. Although the business no longer exists, the full prototype is available on GitHub.",
			"images": [
				"homepage.webp",
				"about.webp",
				"menu.webp",
				"cart.webp",
				"checkout.webp",
				"admindash.webp",
				"adminproducts.webp",
				"adminsales.webp"
			],
			"link": "https://github.com/mgz11/coffee-site"
		}
	],
	"languages": ["Python", "JavaScript", "TypeScript", "HTML/CSS", "JSON"],
	"frameworks": ["React", "Next.js", "Node.js", "Express.js", "Jest", "Tailwind CSS"],
	"tools": ["PostgreSQL", "Prisma", "Figma", "Git", "Stripe", "VS Code"],
	"experience": [
		{
			"job_title": "Code Coach",
			"company": "theCoderSchool",
			"location": "Walnut Creek, CA",
			"timeline": "Aug 2024 - Present"
		},
		{
			"job_title": "Temporary Worker",
			"company": "Stanford University",
			"location": "Stanford, CA",
			"timeline": "July 2019 - Aug 2019"
		}
	]
}
